In [1]:
%load_ext cql

/usr/local/lib/python2.7/dist-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)

In [9]:
%%cql
CREATE KEYSPACE demo 
WITH replication = {'class': 'SimpleStrategy', 'replication_factor' : 1};

'No results.'

In [10]:
%keyspace demo

Using keyspace demo

In [11]:
%%cql
CREATE TABLE users (
firstname text, 
lastname text, 
age int, 
email text, 
city text, 
PRIMARY KEY (lastname));

'No results.'

In [15]:
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('John', 'Smith', 46, 'johnsmith@email.com', 'Sacramento'); 
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('Jane', 'Doe', 36, 'janedoe@email.com', 'Beverly Hills'); 
%cql INSERT INTO users (firstname, lastname, age, email, city) VALUES ('Rob', 'Byrne', 24, 'robbyrne@email.com', 'San Diego');

'No results.'

In [16]:
%cql SELECT * FROM users;

+----------+-----+---------------+---------------------+-----------+
| lastname | age |      city     |        email        | firstname |
+----------+-----+---------------+---------------------+-----------+
|   Doe    |  36 | Beverly Hills |  janedoe@email.com  |    Jane   |
|  Byrne   |  24 |   San Diego   |  robbyrne@email.com |    Rob    |
|  Smith   |  46 |   Sacramento  | johnsmith@email.com |    John   |
+----------+-----+---------------+---------------------+-----------+

In [17]:
%cql SELECT * FR%OM users WHERE lastname= 'Doe';

+----------+-----+---------------+-------------------+-----------+
| lastname | age |      city     |       email       | firstname |
+----------+-----+---------------+-------------------+-----------+
|   Doe    |  36 | Beverly Hills | janedoe@email.com |    Jane   |
+----------+-----+---------------+-------------------+-----------+

In [18]:
%cql UPDATE users SET city= 'San Jose' WHERE lastname= 'Doe';

'No results.'

In [19]:
%cql SELECT * FROM users where lastname= 'Doe';

+----------+-----+----------+-------------------+-----------+
| lastname | age |   city   |       email       | firstname |
+----------+-----+----------+-------------------+-----------+
|   Doe    |  36 | San Jose | janedoe@email.com |    Jane   |
+----------+-----+----------+-------------------+-----------+

In [20]:
%cql DELETE from users WHERE lastname = 'Doe';

'No results.'

In [22]:
%cql SELECT * FROM users;

+----------+-----+------------+---------------------+-----------+
| lastname | age |    city    |        email        | firstname |
+----------+-----+------------+---------------------+-----------+
|  Byrne   |  24 | San Diego  |  robbyrne@email.com |    Rob    |
|  Smith   |  46 | Sacramento | johnsmith@email.com |    John   |
+----------+-----+------------+---------------------+-----------+

In [23]:
%tables

+-------+---------------+----------------+------------------------------+
|  name | partition key | clustering key |          compaction          |
+-------+---------------+----------------+------------------------------+
| users |    lastname   |                | SizeTieredCompactionStrategy |
+-------+---------------+----------------+------------------------------+

In [24]:
%cql DROP KEYSPACE demo

'No results.'